# Задача №39. Общее обсуждение Даны два массива чисел. Требуется вывести те
# элементы первого массива (в том порядке, в каком они идут в первом массиве),
# которых нет во втором массиве. Пользователь вводит  число N - количество элементов в
# первом массиве, затем N чисел - элементы массива. Затем число M - количество элементов
# во втором массиве. Затем элементы второго массива

a = [int(x) for x in input("Числа множества через пробел").split()]
a = [int(x) for x in input("Числа множества через пробел").split()]